<h1>Pandas</h1>

<li>Integrated data manipulation and analysis capabilities
<li>Integration with data visualization libraries
<li>Integration with machine learning libraries
<li>Built in time-series capabilities (Pandas was originally designed for financial time series data)
<li>Optimized for speed
<li>Built-in support for grabbing data from multiple sources csv, xls, html tables, yahoo, google, worldbank, FRED
<li>Integrated data manipulation support (messy data, missing data, feature construction)
<li><b>End to end support for data manipulation, data visualization, data analysis, and presenting results</b>

<h2>Types of data in data analysis</h2>
<li><b>Categorical</b>  data with a fixed (finite) set of values and not necessarily ordered
<ul>
<li>gender, marital status, income level, semester grade etc.
<li>Pandas uses a <b>Categoricals</b> data type to represent this type of data
</ul>
<li><b>Continuous</b> Data that is drawn from an infinite set of ordered values and there are an infinite number of values between any two data elements
<ul>
<li>stock prices, sales revenue, dollar income, etc.
<li>Pandas uses the numpy <b>float</b> and <b>int</b> types to represent this type of data
</ul>
<li><b>Discrete</b> Data that is numerical but cannot be atomized further
<ul>
<li>Counts of categorical data
<li>Number of males, number of people in an income level, etc.
<li>Pandas uses the numpy <b>int</b> to represent this type of data
</ul>

<h3>Pandas organizes data into two data objects</h3>
<li>Series: A one dimensional array object
<li>DataFrame: A two dimensional table object
<ul>
<li>Each column in a dataframe corresponds to a named series

<li>Rows in a dataframe can be indexed by a column of any datatype
</ul>

In [1]:
import pandas as pd       ## pandas requires numpy 
import numpy as np

In [4]:
df = pd.DataFrame([['a',1.2],['b',2.5],['c',4.32],['d',4.98],['e',5.3],['f',9.4],['g',3.3]],
                 columns=['user','rating'])
df

  user  rating
0    a    1.20
1    b    2.50
2    c    4.32
3    d    4.98
4    e    5.30
5    f    9.40
6    g    3.30

In [8]:
integer_ratings = []
for rating in df['rating']:
    integer_ratings.append(np.rint(rating))
    
df['integer ratings'] = integer_ratings
df

  user  rating  integer_ratings  integer ratings
0    a    1.20                1              1.0
1    b    2.50                2              2.0
2    c    4.32                4              4.0
3    d    4.98                4              5.0
4    e    5.30                5              5.0
5    f    9.40                9              9.0
6    g    3.30                3              3.0

<h1>Series</h1>

In [2]:
x = pd.Series(np.random.randint(1000,size=1000))  # Creates a series object
                                                  # generates 1000 random ints btwn 0 and 1000
x[:10]                 # returns the first 10 of numbers of the series

0    108
1     57
2    728
3    252
4    122
5    972
6    438
7    398
8    204
9    965
dtype: int64

In [3]:
print(x.head())
print(x.tail())

0    108
1     57
2    728
3    252
4    122
dtype: int64
995    837
996    720
997    710
998    296
999    671
dtype: int64

<h3>Series are indexed</h3>
<li>Every series contains an index and the values of each index item
<li>Series items must be accessed through the index
<li>Iterators:  iterate on the index returning values

In [4]:
x[0] #0 is the first location

108

In [5]:
# for i in x.index:
#     print(x[i])

In [6]:
#The i's in the following loop are values in x, not locations in x!
# for i in x:
#     print(x[i])

In [7]:
# for i in x:
#     print(i)

<h3>Series and dict</h3>
<li> A dictionary will automatically be broken up into index and value pairs</li>
<li> In the following example, the index is ['a','b','c'] and the series contains [1,2,3]

In [8]:
x = {'a':1,'b':2,'c':3}     # The keys of the dictionary become the row names (indices)
y=pd.Series(x)              # the values are the values of the series
print(y['b'])

2

In [9]:
print(y.values)
type(y.values)   ## if you want to access the actual data sitting inside a series object, use
                 ## the .values function. It returns a numpy array of the values.

[1 2 3]

numpy.ndarray

In [10]:
y[1]

2

<h3>Series objects work like numpy ndarrays</h3>
<li>but with an independent index attached to the values of the array
<li>the index can be of any immutable data type

In [11]:
nums = np.array([1,2,3,4,5,6,7,8,9,10,11,12])
names = np.array(('Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'))
months = pd.Series(nums,index=names)
months['Mar']
#months

3

In [12]:
months[2]

3

In [13]:
months['Mar']

3

<h4>The index attribute returns the index associated with a series<h4>
<li> The data type associated with the index is "pandas index"

In [14]:
months.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct',
       'Nov', 'Dec'],
      dtype='object')

###### Notice the data type above is object. Pandas treats all strings as object data types. It's a string in numpy, but an object in pandas.

<h3>Accessing data by row number</h3>
<li>Series objects are considered to be "ordered"
<li>So we can also access objects by row number

In [15]:
months[1]

2

<h4>And we can find the row number given an index value<p>
and then use that to access the data at that row</h4>

In [16]:
row = months.index.get_loc('Mar')    # Gets the index number corresponding to index value.
months.iloc[row]    ## Use the index # to access the data in that row.
                    ## Have to pass the row/index number when using df.iloc[] method.

3

In [17]:
print('The index number associated with index value Mar is',row,'.\nThe data stored in that position is', months.iloc[row],'.')

The index number associated with index value Mar is 2 .
The data stored in that position is 3 .

In [18]:
months.loc['Mar']    ## Have to pass the row name/value for the df.loc[] method.

3

<h4>We can do numpy operations on a pandas series</h4>

<b>Scalar multiplication

In [19]:
months*2

Jan     2
Feb     4
Mar     6
Apr     8
May    10
Jun    12
Jul    14
Aug    16
Sep    18
Oct    20
Nov    22
Dec    24
dtype: int64

<b>addition

In [20]:
x=pd.Series([1,3,5,7,11])
z = pd.Series([1,2,3,4,5])
x+z   ## you can do this because both series share the same index

0     2
1     5
2     8
3    11
4    16
dtype: int64

<h4>provided the indexes match</h4>

In [21]:
nums = np.array([1,2,3,4,5,6,7,8,9,10,11,12])
names = np.array(('Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'))
months = pd.Series(nums,index=names)
things = ['partridge','turtle dove','french hen','calling birds','golden rings','geese','swans','milking maids',
                'dancing ladies','leaping lords','piping pipers','drumming drummers' ]
days_of_xmas = pd.Series(nums,things)
months + days_of_xmas

Apr                 NaN
Aug                 NaN
Dec                 NaN
Feb                 NaN
Jan                 NaN
Jul                 NaN
Jun                 NaN
Mar                 NaN
May                 NaN
Nov                 NaN
Oct                 NaN
Sep                 NaN
calling birds       NaN
dancing ladies      NaN
drumming drummers   NaN
french hen          NaN
geese               NaN
golden rings        NaN
leaping lords       NaN
milking maids       NaN
partridge           NaN
piping pipers       NaN
swans               NaN
turtle dove         NaN
dtype: float64

###### The reason the two series above did not add as expected is because the two series have different indices. The indices must be identical in order to add two series.

<h3>Timeseries objects</h3>
<li>Timeseries data in pandas is represented by a series
<li>Indexed by time
<li>A series can be read directly from a csv file
<li>And then the str date converted into a Timestamp object

In [22]:
gs_price_data = pd.read_csv("GS.csv",index_col="Date")

In [23]:
type(gs_price_data)   # even though it's only one column of data, it automatically creates a
                      # a dataframe object from the data

pandas.core.frame.DataFrame

In [24]:
gs_price_data         # Notice the column names of the dataframe

             Adj Close
Date
2018-08-22  238.550003
2018-08-23  235.559906
2018-08-24  234.333969
2018-08-27  241.799255
2018-08-28  241.569992
2018-08-29  241.399994
2018-08-30  239.399994
2018-08-31  237.809998
2018-09-04  237.660004
2018-09-05  237.559998
2018-09-06  234.520004
2018-09-07  233.910004
2018-09-10  231.910004
2018-09-11  230.210007
2018-09-12  228.149994
2018-09-13  228.330002
2018-09-14  229.240005
2018-09-17  227.889999
2018-09-18  228.889999
2018-09-19  235.580002
2018-09-20  237.399994
2018-09-21  235.339996

In [25]:
gs_price_data = pd.read_csv("GS.csv",index_col="Date",squeeze=True) 
# Setting squeeze = True creates a series object from the data since only one column of data.

In [26]:
gs_price_data        # notice no column name for series object. Lose the column name for series.

Date
2018-08-22    238.550003
2018-08-23    235.559906
2018-08-24    234.333969
2018-08-27    241.799255
2018-08-28    241.569992
2018-08-29    241.399994
2018-08-30    239.399994
2018-08-31    237.809998
2018-09-04    237.660004
2018-09-05    237.559998
2018-09-06    234.520004
2018-09-07    233.910004
2018-09-10    231.910004
2018-09-11    230.210007
2018-09-12    228.149994
2018-09-13    228.330002
2018-09-14    229.240005
2018-09-17    227.889999
2018-09-18    228.889999
2018-09-19    235.580002
2018-09-20    237.399994
2018-09-21    235.339996
Name: Adj Close, dtype: float64

In [27]:
gs_price_data[0]

238.55000299999998

In [28]:
gs_price_data.index[0]

'2018-08-22'

In [29]:
pd.read_csv("GS.csv")   #creates a dataframe with 2 columns since we don't specify the index.

          Date   Adj Close
0   2018-08-22  238.550003
1   2018-08-23  235.559906
2   2018-08-24  234.333969
3   2018-08-27  241.799255
4   2018-08-28  241.569992
5   2018-08-29  241.399994
6   2018-08-30  239.399994
7   2018-08-31  237.809998
8   2018-09-04  237.660004
9   2018-09-05  237.559998
10  2018-09-06  234.520004
11  2018-09-07  233.910004
12  2018-09-10  231.910004
13  2018-09-11  230.210007
14  2018-09-12  228.149994
15  2018-09-13  228.330002
16  2018-09-14  229.240005
17  2018-09-17  227.889999
18  2018-09-18  228.889999
19  2018-09-19  235.580002
20  2018-09-20  237.399994
21  2018-09-21  235.339996

In [30]:
gs_price_data.index = pd.to_datetime(gs_price_data.index)   # converts string to datetime object

# Notice the .index on the LHS. This reassigns the index as the datetime object for this df.

## Why convert this to a datetime object?
## To be able to sort in case entered as a string and, more generally, to be able to do
## datetime arithmetic: going back and forth in time using arithmetic on referenced time/date.
## Cannot do this if the date is just a string. Has to be converted to a datetime object.
## There's a similar function: strptime() which converts a string to a datetime object

In [31]:
gs_price_data.index[0]    ## notice it is no longer a string. It is a Timestamp object.

Timestamp('2018-08-22 00:00:00')

<h3>Accessing data using a Timestamp index</h3>
<li>Key values passed to the Series must be of type Timestamp
<li>We need to convert str time into Timestamps
<li>pd.to_datetime will do this for us (we could also use the datetime library)
<li>index.get_loc gets the row number corresponding to the timestamp
<li>and, finally .iloc[row_number] returns the data

In [32]:
dt = pd.to_datetime('2018-08-23')
row = gs_price_data.index.get_loc(dt)
gs_price_data.iloc[row]

## There is a less convoluted way to do this, but there is a reason for doing it this way.
## We use this approach in case the date falls on a weekend or holiday or something.

235.559906

<h4>get_loc can find the 'nearest' or next ('backfill') or use the most recent ('pad')

In [33]:
dt = pd.to_datetime('2018-09-01')
row = gs_price_data.index.get_loc(dt,method="pad") #'nearest', 'pad', 'backfill'
gs_price_data.iloc[row]

## use "pad" to guarantee it returns a row number (see next cell)

237.809998

In [34]:
# pandas.index.get_loc(key, method = '') 
# Possible arguments for the method parameter:

# default: exact matches only.
# pad / ffill: find the PREVIOUS index value if no exact match.
# backfill / bfill: use NEXT index value if no exact match
# nearest: use the NEAREST index value if no exact match. Tied distances are broken by preferring the larger index value.

<h4>Statistics on a series</h4>

In [35]:
gs_price_data.mean()
#gs_price_data.std()
#gs_price_data.pct_change()

234.8642328636364

<h1>pandas DataFrame</h1>
<li>2-Dimensional structure
<li>Columns can contain data of different types (like an Excel spreadsheet)
<li>However, within a column, all the rows must be the same data type. Across columns, they can be different.    
<li>Can contain an index (or indices)
<li>Columns (and indices) can be named
<li>In a dataframe, every column has a name, and every row has a name which is the index value.

<h3>Constructing a dataframe</h3>

In [36]:
df = pd.DataFrame([[11,22,13],[21,22,23]])
df

    0   1   2
0  11  22  13
1  21  22  23

In [37]:
df = pd.DataFrame([[11,22,13],[21,22,23]])

# You can name the columns and indices after the creating the dataframe
df.columns=['c1','c2','c3']   
df.index = ['a','b']
df

   c1  c2  c3
a  11  22  13
b  21  22  23

In [38]:
# Or you can name the columns and indices at the time of creation of the dataframe:
df = pd.DataFrame([[11,22,13],[21,22,23]],index=['a','b'],columns=['c1','c2','c3'])
df

   c1  c2  c3
a  11  22  13
b  21  22  23

In [39]:
fico_df = pd.DataFrame([[802,0],[9003,1],[766,0],[843,0],[604,-1],[9002,1],[579,1],[758,0],[9003,0],[0,0],[679,-1]])

# You can name the columns and indices after the creating the dataframe
fico_df.columns=['fico','bad']   
fico_df.index = ['a','b','c','d','e','f','g','h','i','j','k']
fico_df

   fico  bad
a   802    0
b  9003    1
c   766    0
d   843    0
e   604   -1
f  9002    1
g   579    1
h   758    0
i  9003    0
j     0    0
k   679   -1

In [40]:
fico_df[(fico_df.fico<=850) & (fico_df.fico>0) & (fico_df.bad > -1)]

   fico  bad
a   802    0
c   766    0
d   843    0
g   579    1
h   758    0

In [41]:
from datetime import date
date(2018,9,23)

datetime.date(2018, 9, 23)

In [42]:
tickers = ['AAPL','GOOG','GS']
dates = ['20180924','20180925']
data = np.zeros((2,3))
df = pd.DataFrame(data,index=dates,columns=tickers)
df

          AAPL  GOOG   GS
20180924   0.0   0.0  0.0
20180925   0.0   0.0  0.0

In [43]:
tickers = ['AAPL','GOOG','GS']
from datetime import date
dates = [date(2018,10,2),date(2018,10,3)]
data = np.zeros((2,3))
df = pd.DataFrame(data,index=dates,columns=tickers)
df

            AAPL  GOOG   GS
2018-10-02   0.0   0.0  0.0
2018-10-03   0.0   0.0  0.0

In [44]:
type(dates[0])

datetime.date

In [45]:
## Passing a dictionary to a df, the keys become the column names instead of index/row names like for a series.
data = {'AAPL':[0.0,0.0],'GOOG':[0.0,0.0],'GS':[0.0,0.0]}   
df = pd.DataFrame(data)
df.index = [date(2018,10,2),date(2018,10,3)]
df

            AAPL  GOOG   GS
2018-10-02   0.0   0.0  0.0
2018-10-03   0.0   0.0  0.0

<h3>Using an existing column as an index</h3>
<li>By default, pandas will return a copy with the index added
<li>Use the inplace parameter to do modify the df itself

In [46]:
df = pd.DataFrame([['r1','00','01','02'],['r2','10','11','12'],['r3','20','21','22']],columns=['row_label','A','B','C'])
print(df)

df.set_index('row_label',inplace=True)  # use the 'row label' column as the index column
                                        # inplace=True means to overwrite the original df and not create a new one. 
                                        # inplace=True changes it in place.
print(df)  ## notice the df is such that the row label is the index

df = pd.DataFrame([['r1','00','01','02'],['r2','10','11','12'],['r3','20','21','22']],columns=['row_label','A','B','C'])
df.set_index('row_label',inplace=False)
print(df)   ## with inplace=False, pandas leaves the original dataframe alone.

  row_label   A   B   C
0        r1  00  01  02
1        r2  10  11  12
2        r3  20  21  22
            A   B   C
row_label
r1         00  01  02
r2         10  11  12
r3         20  21  22
  row_label   A   B   C
0        r1  00  01  02
1        r2  10  11  12
2        r3  20  21  22

<h4>Pandas dataframes work like dictionaries</h4>
<li>Column names can be used to access a column as a series from a df

In [47]:
data = {'AAPL':[217.2,218.7],'GOOG':[1166.2,1161.5],'GS':[235.3,231.1]}
df = pd.DataFrame(data)
df.index = [date(2018,9,21),date(2018,9,24)]
df

             AAPL    GOOG     GS
2018-09-21  217.2  1166.2  235.3
2018-09-24  218.7  1161.5  231.1

In [48]:
df['AAPL']

2018-09-21    217.2
2018-09-24    218.7
Name: AAPL, dtype: float64

In [49]:
type(df['AAPL'])   ## notice the df columns are accessed as series objects.

pandas.core.series.Series

<h4>Single columns (with no spaces in their names) can also be accessed using the attribute syntax

In [50]:
df.AAPL     # only works if the column name has no empty spaces in the name

2018-09-21    217.2
2018-09-24    218.7
Name: AAPL, dtype: float64

<h4>Chained indexing leads to a specific cell in the table</h4>

In [51]:
df['AAPL'][date(year=2018,month=9,day=24)]

218.7

<h3>Selecting rows</h3>
<li>rows can be selected using the index df.loc[index_value]
<li>or using row number df.iloc[row_number]
<li>Note that both methods use dictionary like indexing!

In [52]:
df.loc[date(2018,9,21)]   
# notice that the column names become index values of a series object (see type in next cell)
# You're essentially extracting one row of the dataframe. That one row is presented as a 
# series object where the columns are transformed into rows and so column names become row names.

AAPL     217.2
GOOG    1166.2
GS       235.3
Name: 2018-09-21, dtype: float64

In [53]:
type(df.loc[date(2018,9,21)])

pandas.core.series.Series

In [54]:
df.iloc[0]    # same output using index number instead

AAPL     217.2
GOOG    1166.2
GS       235.3
Name: 2018-09-21, dtype: float64

<h4>Accessing a specific value</h4>

In [55]:
df['AAPL'].loc[date(2018,9,21)]
#df.loc[date(2018,9,21)]['AAPL']

217.2

<h4>Add a new column</h4>

In [56]:
# Notice df['IONS'] must be on the lefthand side to create/define the new column.
df['IONS'] = np.NaN   # Defining a new column with null values
df

             AAPL    GOOG     GS  IONS
2018-09-21  217.2  1166.2  235.3   NaN
2018-09-24  218.7  1161.5  231.1   NaN

<h4>Selecting multiple columns (or a subset of columns)</h4>
<li>Use a <b>list</b> containing the names of the desired rows

In [57]:
df[['AAPL','GOOG']]   ## Selecting a subset of columns. Use a list of the column names.
                      ## Creates a new dataframe with fewer columns.

             AAPL    GOOG
2018-09-21  217.2  1166.2
2018-09-24  218.7  1161.5

In [58]:
df = pd.DataFrame([[11,22,13],[21,22,23]])
df.columns=['c1','c2','c3']
df.index = ['a','b']
df

   c1  c2  c3
a  11  22  13
b  21  22  23

<h4>Creating a new column using a pattern</h4>

In [59]:
## Notice df['Mult3'] is on the lefthand side. In doing so, you're defining a new column. 
## To populate the column, np.where() is used.

df['Mult3'] = np.where(df['c1']%3==0,1,0)   # 1 if a multiple of 3, 0 otherwise.
df

   c1  c2  c3  Mult3
a  11  22  13      0
b  21  22  23      1

<h3>Slicing</h3>

In [60]:
df = pd.DataFrame([[11,12,13,14,15],
                   [21,22,23,24,25],
                   [31,32,33,34,35],
                   [41,42,43,44,45],
                   [51,52,53,54,55]])
df.index =['r1','r2','r3','r4','r5']
df.columns = ['c1','c2','c3','c4','c5']
df

    c1  c2  c3  c4  c5
r1  11  12  13  14  15
r2  21  22  23  24  25
r3  31  32  33  34  35
r4  41  42  43  44  45
r5  51  52  53  54  55

In [61]:
df.loc['r2':'r4']   # Notice it gives r2, r3, AND r4, whereas slicing with np.arrays it doesn't
                    # include values specified by the upper end.

    c1  c2  c3  c4  c5
r2  21  22  23  24  25
r3  31  32  33  34  35
r4  41  42  43  44  45

In [62]:
df.loc[:,'c2':'c4']

    c2  c3  c4
r1  12  13  14
r2  22  23  24
r3  32  33  34
r4  42  43  44
r5  52  53  54

In [63]:
df.loc['r2':'r4','c2':'c4']

    c2  c3  c4
r2  22  23  24
r3  32  33  34
r4  42  43  44

In [64]:
df.iloc[1:4,1:4]   ## Recall: must use .iloc to use index numbers.
                   ## When using index numbers, it does NOT include values specified by 
                   ## the upper end.

    c2  c3  c4
r2  22  23  24
r3  32  33  34
r4  42  43  44

<h3>Working with views and copies</h3>

In [65]:
df = pd.DataFrame([[11,12,13,14,15],
                   [21,22,23,24,25],
                   [31,32,33,34,35],
                   [41,42,43,44,45],
                   [51,52,53,54,55]])
df.index =['r1','r2','r3','r4','r5']
df.columns = ['c1','c2','c3','c4','c5']
df_new = df

<h4>df_new points to the same dataframe as df</h4>

In [66]:
print(id(df),id(df_new))   # same memory location since df_new is referencing df

4839890320 4839890320

<h4>Changes in df will result in a change in df_new</h4>

In [67]:
df.loc['r3','c3'] = 99
df_new

    c1  c2  c3  c4  c5
r1  11  12  13  14  15
r2  21  22  23  24  25
r3  31  32  99  34  35
r4  41  42  43  44  45
r5  51  52  53  54  55

<h4>To work with a copy, use .copy()</h4>
<h4>That is, if your intent is to create a new dataframe, use .copy() instead of assigning it to the dataframe being referenced.</h4>

In [68]:
df = pd.DataFrame([[11,12,13,14,15],
                   [21,22,23,24,25],
                   [31,32,33,34,35],
                   [41,42,43,44,45],
                   [51,52,53,54,55]])
df.index =['r1','r2','r3','r4','r5']
df.columns = ['c1','c2','c3','c4','c5']
df_new = df.copy()       # make the copy first before making the change
df.loc['r3','c3'] = 99   # make the change afterward
df_new

    c1  c2  c3  c4  c5
r1  11  12  13  14  15
r2  21  22  23  24  25
r3  31  32  33  34  35
r4  41  42  43  44  45
r5  51  52  53  54  55

<h1>Grouping functionality in Pandas</h1>
<li>Pandas allows grouping by value as well as grouping by functions

In [69]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'D' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three']})
df

     A      B      C      D
0  foo    one    one    one
1  bar    one    one    one
2  foo    two    two    two
3  bar  three  three  three
4  foo    two    two    two
5  bar    two    two    two
6  foo    one    one    one
7  foo  three  three  three

<h3>Group by column values</h3>

In [70]:
df.groupby('B')   # Forms groups in entire df based on each distinct value in column 'B'
                  # There are 3 distinct values in 'B' so it forms 3 groups. Each group
                  # contains rows from the original table.

In [71]:
df.groupby('B').size()   # returns a series object where the index values are the distinct
                         # values in column 'B', and the values are the number of rows in
                         # that subgroup.

B
one      3
three    2
two      3
dtype: int64

<h3>Group by multiple columns</h3>

In [72]:
df.groupby(['A','C']).size()

A    C
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

<h3>Grouping by function</h3>

In [73]:
import pandas as pd
import numpy as np
people = pd.DataFrame(np.random.randn(5, 5), columns=['a', 'b', 'c', 'd', 'e'], index=['Joe', 'Moe', 'Jill', 'Qing', 'Ariana'])
people

               a         b         c         d         e
Joe     1.133990 -1.417947 -2.173414  1.374230  0.603197
Moe    -0.443974  1.123463  0.058651 -0.702142 -2.552015
Jill    0.112853  1.068146 -0.335545 -0.614932  0.178181
Qing   -0.920537 -0.672958 -0.641436 -1.242710  0.980196
Ariana -0.165640 -1.483028  0.372127  0.663928  0.857822

In [74]:
people['b'].iloc[1]

1.1234629472918691

<li>We want to choose a column and group elements in the column into two categories
<li>A cell value less than 0, will belong to the group "Negative"
<li>A cell with value greater or equal to 0, will belong to the group "Positive"

<li>We need to write a function that takes a dataframe, a column, and a row index as arguments
<li>The three arguments together will point to a single value
<li>And we can test the value to see which group it belongs to
<li>And return the group label

In [75]:
def GroupColFunc(df, ind, col='a'):
    if df[col].loc[ind] < 0:       # The index here is the name of the specific row
        return 'Negative'
    else:
        return 'Positive'

# This is NOT grouping by a column. This is grouping by a function.

In [76]:
# Alternative version
def GroupColFunc2(ind, df=people, col='a'):
    if df[col].loc[ind] < 0:      
        return 'Negative'
    else:
        return 'Positive'

<li>Finally, we'll pass the function to groupby
<li>Just like groupby used the values foo, bar etc. to group the data,
<li>It will use the values returned by the function to group the data

In [77]:
grouped = people.groupby(lambda x: GroupColFunc(people, x, 'a'))  
grouped
print(grouped.size())
# Result: two people grouped in the Negative group, and three people in the Positive group.

Negative    3
Positive    2
dtype: int64

In [78]:
## The lambda function is an anonymous function. The implementation of the lambda function is
## delayed until you actually need to use it. It's a function you use once that is created on
## the fly. In the example above, the value x is an input into the lambda function. 
## x are the indices since when grouping by a function, groupby() is called on
## each value of the object's index (Source: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)

<h3>Group statistics</h3>

In [79]:
grouped.mean()
#grouped.std()
#grouped.count()
#grouped.cumcount()

#%matplotlib inline
#grouped.mean().plot(kind='bar')

                 a         b         c         d         e
Negative -0.510050 -0.344174 -0.070219 -0.426975 -0.237999
Positive  0.623422 -0.174901 -1.254480  0.379649  0.390689

In [80]:
## Returns mean for all 5 columns since we didn't specify which column.

<h3>Digression: Lambda functions</h3>
<li>Anonymous or "throw-away" functions
<li>Useful for dataframe operations
<li>Useful for defining functions for simple operations

In [81]:
foo = lambda x,y: x+y
foo(2,3)

5

<h4>Example: We can change the sort parameter using a function</h4>

In [82]:
x=[(1,2),(4,5),(3,3),(9,1)]
def sort_key(x):
    return x[1]
sorted(x,key=sort_key)   ## sort by the 2nd value of the tuple using sort_key

[(9, 1), (1, 2), (3, 3), (4, 5)]

<h3>Or we can "inline" the function</h3>
<li>Makes it more readable

In [83]:
x=[(1,2),(4,5),(3,3),(4,1)]
sorted(x,key=lambda x: x[1])

[(4, 1), (1, 2), (3, 3), (4, 5)]

In [84]:
x=[(1,2),(4,5),(3,3),(4,1)]
sorted(x,key=lambda x: x[0] + x[1])

[(1, 2), (4, 1), (3, 3), (4, 5)]

<h2>Join, merge and concatenate dataframes</h2>
<li>Pandas will try to do a "good" operation

In [85]:
df1 = pd.DataFrame([[1,2,3],[4,5,6]],index=['a','b'],columns=['A','B','C'])
df1

   A  B  C
a  1  2  3
b  4  5  6

In [86]:
df2 = pd.DataFrame([[7,8,9],[10,11,12]],index=['c','d'],columns=['A','B','C'])
df2

    A   B   C
c   7   8   9
d  10  11  12

In [87]:
pd.concat([df1,df2])    ## default of concat is vertical stacking (axis=0). Adds up nicely since column names are the same.
                        ## axis=1 corresponds to horizontal stacking.
                        ## pd.concat is a class-level function, which is why you have to pass both dataframes as arguments.

    A   B   C
a   1   2   3
b   4   5   6
c   7   8   9
d  10  11  12

<h3>Concat can handle column mismatches</h3>

In [88]:
df2 = pd.DataFrame([[7,8,9],[10,11,12]],index=['c','d'],columns=['K','B','C'])
df2

    K   B   C
c   7   8   9
d  10  11  12

In [89]:
pd.concat([df1,df2])   ## you get all the columns because you're doing an outer join (union).
                       ## join ='outer' is the default.
                       ## join = 'outer' is a union of the input columns

     A   B   C     K
a  1.0   2   3   NaN
b  4.0   5   6   NaN
c  NaN   8   9   7.0
d  NaN  11  12  10.0

In [90]:
pd.concat([df1,df2],join='inner')   ## Using join='inner', only the common columns join together.
                                    ## join = 'inner' is the intersection of the input columns.

    B   C
a   2   3
b   5   6
c   8   9
d  11  12

In [91]:
pd.concat([df1,df2], axis=0,join='outer')   ##axis=0 and join='outer' are the default values, so gives the same results as pd.concat([df1,df2])

     A   B   C     K
a  1.0   2   3   NaN
b  4.0   5   6   NaN
c  NaN   8   9   7.0
d  NaN  11  12  10.0

<h4>Concat works with multiple data frames and creates copies. Append appends to an existing dataframe</h4>

In [92]:
df1.append(df2)     # Does the same thing as the class method concat. It appends a dataframe to an existing dataframe, creating a whole new dataframe.

     A   B   C     K
a  1.0   2   3   NaN
b  4.0   5   6   NaN
c  NaN   8   9   7.0
d  NaN  11  12  10.0

<h3>Join</h3>
<li>Pandas provides a full featured join (like SQL)
<li>https://pandas.pydata.org/pandas-docs/stable/merging.html

In [93]:
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]],index=['a','b','c','d'],columns=['A','B','C'])
df1

    A   B   C
a   1   2   3
b   4   5   6
c   7   8   9
d  10  11  12

In [94]:
df2 = pd.DataFrame([[17,18,19],[101,111,121]],index=['c','d'],columns=['K','L','D'])
df2

     K    L    D
c   17   18   19
d  101  111  121

In [95]:
df1.join(df2)

    A   B   C      K      L      D
a   1   2   3    NaN    NaN    NaN
b   4   5   6    NaN    NaN    NaN
c   7   8   9   17.0   18.0   19.0
d  10  11  12  101.0  111.0  121.0

In [96]:
df1.join(df2, how='right')  ## how='right' joins based on the other's index (df2's index). It preserves everything df2 has only.

    A   B   C    K    L    D
c   7   8   9   17   18   19
d  10  11  12  101  111  121

In [97]:
df1.join(df2, how='left')   # how='left' joins based on the caller's index (df1's index). It preserves everything df1 has only.
                            # This is the default specification.

    A   B   C      K      L      D
a   1   2   3    NaN    NaN    NaN
b   4   5   6    NaN    NaN    NaN
c   7   8   9   17.0   18.0   19.0
d  10  11  12  101.0  111.0  121.0

In [98]:
df2.merge(df1, left_index=True, right_index=True)

     K    L    D   A   B   C
c   17   18   19   7   8   9
d  101  111  121  10  11  12

In [99]:
df2.merge(df1)  # By default, merge joins dfs by common columns. 
                # Therefore, this won't work because the two have no common columns.
                # default is an inner join

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [100]:
## Redefining df2 as a dataframe with columns in common with df1:
df2 = pd.DataFrame([[7,8,9],[10,11,12]],index=['c','d'],columns=['K','B','C'])

In [101]:
df2.merge(df1)   # Now it works since there are common columns (common column names). It does an outer join by default.

    K   B   C   A
0   7   8   9   7
1  10  11  12  10

<h1>Working with Pandas</h1>

In [102]:
pd.__version__

'1.0.3'

In [103]:
#installing pandas libraries
#!source activate py36;pip install pandas --upgrade
#!source activate py36;pip install pandas-datareader --upgrade
!pip install --upgrade html5lib==1.0b8

#There is a bug in the latest version of html5lib so install an earlier version
#Restart kernel after installing html5lib

Requirement already satisfied: html5lib==1.0b8 in /Users/josephhigh/opt/anaconda3/lib/python3.8/site-packages (1.0b8)
Requirement already satisfied: six in /Users/josephhigh/opt/anaconda3/lib/python3.8/site-packages (from html5lib==1.0b8) (1.15.0)

<h2>Imports</h2>

In [104]:
#!conda install pandas-datareader

In [106]:
import pandas as pd #pandas library
from pandas_datareader import data #data readers (google, html, etc.)
#The following line ensures that graphs are rendered in the notebook
%matplotlib inline 
import numpy as np
import matplotlib.pyplot as plt #Plotting library
import datetime as dt #datetime for timeseries support

<h2>Pandas datareader</h2>
<li>Access data from html tables on any web page</li>
<li>Get data from google finance</li>
<li>Get data from the federal reserve</li>
<li>Read csv files</li>

<h3>HTML Tables</h3>
<li>Pandas datareader can read a table in an html page into a dataframe
<li>the read_html function returns a list of all dataframes with one dataframe for each html table on the page

<h4>Example: Read tables from an html page</h4>

In [107]:
import requests
df_list = pd.read_html('https://www.x-rates.com/table/?from=USD&amount=1')
#df_list = pd.read_html("https://eresearch.fidelity.com/eresearch/goto/markets_sectors/landing.jhtml",flavor="bs4")
print(len(df_list))

ImportError: lxml not found, please install it

<h4>The page contains two tables</h4>

In [ ]:
df1 = df_list[0]
df2 = df_list[1]
print(df1)
print(df2)

<h4>Note that the read_html function has automatically detected the header columns</h4>
<h4>If an index is necessary, we need to explicitly specify it</h4>

In [ ]:
df1

In [ ]:
df1.set_index('US Dollar',inplace=True)
print(df1)

<h4>Now we can use .loc to extract specific currency rates</h4>

In [ ]:
df1.loc['Euro','1.00 USD']

<h2>Getting historical stock prices from yahoo finance</h2>
Usage: DataReader(ticker,source,startdate,enddate)<br>

In [ ]:
from pandas_datareader import data as web
import yfinance as yf    # yfinance is sometimes unreliable, so use pandas_datareader
import datetime
start=datetime.datetime(2000, 1, 1)
end=datetime.datetime.today()
print(start,end)

df = web.DataReader('IBM', 'yahoo', start, end)

In [ ]:
df

<h2>Datareader documentation</h2>
http://pandas-datareader.readthedocs.io/en/latest/</h2>

<h3>Working with a timeseries data frame</h3>
<li>The data is organized by time with the index serving as the timeline

<h4>Creating new columns</h4>
<li>Add a column to a dataframe
<li>Base the elements of the column on some combination of data in the existing columns
<h4>Example: Number of Days that the stock closed higher than it opened
<li>We'll create a new column with the header "UP"
<li>And use np.where to decide what to put in the column

In [ ]:
df['UP']=np.where(df['Close']>df['Open'],1,0)
df

<h3>Get summary statistics</h3>
<li>The "describe" function returns a dataframe containing summary stats for all numerical columns
<li>Columns containing non-numerical data are ignored

In [ ]:
df.describe()

<h4>Calculate the percentage of days that the stock has closed higher than its open</h4>

In [ ]:
df['UP'].sum()/df['UP'].count()

<h4>Calculate percent changes</h4>
<li>The function pct_change computes a percent change between successive rows (times in  timeseries data)
<li>Defaults to a single time delta
<li>With an argument, the time delta can be changed

In [ ]:
df['Close'].pct_change() # One timeperiod percent change

In [ ]:
n=13
df['Close'].pct_change(n) # n timeperiods percent change

<h3>NaN support</h3>
Pandas functions can ignore NaNs

In [ ]:
n=13
df['Close'].pct_change(n).mean()

<h3>Rolling windows</h3>
<li>"rolling" function extracts rolling windows
<li>For example, the 21 period rolling window of the 13 period percent change

In [ ]:
df['Close'].pct_change(n).rolling(21)

<h4>Calculate something on the rolling windows</h4>

<h4>Example: mean (the 21 day moving average of the 13 day percent change)

In [ ]:
n=13
df['Close'].pct_change(n).rolling(21).mean()

<h4>Calculate several moving averages and graph them</h4>

In [ ]:
ma_8 = df['Close'].pct_change(n).rolling(window=8).mean()
ma_13= df['Close'].pct_change(n).rolling(window=13).mean()
ma_21= df['Close'].pct_change(n).rolling(window=21).mean()
ma_34= df['Close'].pct_change(n).rolling(window=34).mean()
ma_55= df['Close'].pct_change(n).rolling(window=55).mean()

In [ ]:
ma_8.head(25)

In [ ]:
ma_13.head(25)

<h2>Plotting pandas series</h2>
<li>Pandas is tightly integrated with matplotlib, a graphing library
<li>All you need do is call 'plot' on any series
<li>When working on a jupyter notebook, add %matplotlib inline

In [ ]:
%matplotlib inline   # allows plots to display within the same notebook, rather than open up in a new jupyter notebook.

In [ ]:
ma_8.plot()     # recall these are both dataframe objects
ma_34.plot()    # ma_8 and ma_34 are both dataframe objects, so they can be plotted.

<h2>Linear regression with pandas</h2>
<h4>Example: TAN is the ticker for a solar ETF. FSLR,  and SPWR are tickers of companies that build or lease solar panels. Each has a different business model. We'll use pandas to study the risk reward tradeoff between the 3 investments and also see how correlated they are</h4>

In [ ]:
!source activate py36;pip install fix-yahoo-finance

In [ ]:
import datetime
import pandas_datareader.data as web
import yfinance as yf
start = datetime.datetime(2015,7,1)
end = datetime.datetime(2016,7,1)
solar_df = web.DataReader(['FSLR', 'TAN','SPWR'],'yahoo', start,end)['Close']

In [ ]:
solar_df

<h4>Let's calculate returns (the 1 day percent change)</h4>

In [ ]:
rets = solar_df.pct_change()
print(rets)

<h4>Let's visualize the relationship between each stock and the ETF</h4>

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline
plt.scatter(rets.FSLR,rets.TAN)

In [ ]:
plt.scatter(rets.SPWR,rets.TAN)

<h4>The correlation matrix</h4>

In [ ]:
solar_corr = rets.corr()
print(solar_corr)

<h3>Basic risk analysis</h3>
<h4>We'll plot the mean and std or returns for each ticker to get a sense of the risk return profile</h4>

In [ ]:
plt.scatter(rets.mean(), rets.std())
plt.xlabel('Expected returns')
plt.ylabel('Standard deviations')
for label, x, y in zip(rets.columns, rets.mean(), rets.std()):
    plt.annotate(
        label, 
        xy = (x, y), xytext = (20, -20),
        textcoords = 'offset points', ha = 'right', va = 'bottom',
        bbox = dict(boxstyle = 'round,pad=0.5', fc = 'yellow', alpha = 0.5),
        arrowprops = dict(arrowstyle = '->', connectionstyle = 'arc3,rad=0'))
plt.show()

<h2>Regressions</h2>
http://statsmodels.sourceforge.net/

<h3>Steps for regression</h3>
<li>Construct y (dependent variable series)
<li>Construct matrix (dataframe) of X (independent variable series)
<li>Add intercept
<li>Model the regression
<li>Get the results
<h3>The statsmodels library contains various regression packages. We'll use the OLS (Ordinary Least Squares) model

In [ ]:
import numpy as np
import statsmodels.api as sm
X=solar_df[['FSLR','SPWR']]
X = sm.add_constant(X)
y=solar_df['TAN']
model = sm.OLS(y,X,missing='drop')
result = model.fit()
print(result.summary())

<h4>Finally plot the fitted line with the actual y values

In [ ]:
fig, ax = plt.subplots(figsize=(8,6))
ax.plot(y)
ax.plot(result.fittedvalues)